---
kind: property
id: P:Autodesk.Revit.DB.Events.PostEventArgs.Status
source: html/915572e2-dd04-ab0f-44b5-1f00d1d276d7.htm
---
# Autodesk.Revit.DB.Events.PostEventArgs.Status Property

Indicates whether the action associated with this event succeeded, failed, or was cancelled (by an APIevent handler).

## Syntax (C#)
```csharp
public EventStatus Status { get; }
```